tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-radiation/0/solid/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    leftSolid
    {
        type            zeroGradient;
    }
    rightSolid
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            chtRcThermalDiffusivity;
        remoteField     kappaEff;
        value           uniform 1e-3;
    }
    topWall
    {
        type            chtRcThermalDiffusivity;
        remoteField     kappaEff;
        value           uniform 1e-3;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
