tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-radiation/constant/solid/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermal
{
    type    constant;

    // Density
    rho             rho [1 -3 0 0 0] 1750;

    // Specific heat capacity
    C               C [0 2 -2 -1 0] 1000;

    // Thermal conductivity
    // k               k [1 1 -3 -1  0] 30;
    k               k [1 1 -3 -1  0] 0.1;

    // Thermal expansion coefficient
    alpha           alpha [0 0 0 -1 0 0 0] 0;

    // Reference temperature for thermal expansion
    T0              T0 [0 0 0 1 0 0 0] 300;

    gaps
    ();

    sources
    ();
}


conjugateThermalSource
{}


// ************************************************************************* //
